tests/test_case/pitzDaily/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
12225
(
(-0.0198086 0.00015942 0)
(-0.0182574 0.00015942 0)
(-0.0167681 0.00015942 2.78877e-20)
(-0.0153384 0.00015942 0)
(-0.0139658 0.00015942 0)
(-0.012648 0.00015942 0)
(-0.0113829 0.00015942 0)
(-0.0101683 0.00015942 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(-0.0206 0.00015942 0)
(-0.0206 0.000489703 0)
(-0.0206 0.000843691 0)
(-0.0206 0.00122309 0)
(-0.0206 0.00162971 0)
(-0.0206 0.00206552 0)
(-0.0206 0.00253261 0)
(-0.0206 0.00303323 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
57
(
(0.29 -0.0162926 0)
(0.29 -0.0156778 0)
(0.29 -0.015063 0)
(0.29 -0.0144481 0)
(0.29 -0.0138333 0)
(0.29 -0.0132185 0)
(0.29 -0.0126037 0)
(0.29 -0.0119889 0)
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<vector> 
223
(
(-0.0198086 0.0254 0)
(-0.0182574 0.0254 0)
(-0.0167681 0.0254 0)
(-0.0153384 0.0254 0)
(-0.0139658 0.0254 0)
(-0.012648 0.0254 0)
(-0.0113829 0.0254 0)
(-0.0101683 0.0254 0)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
250
(
(-0.0198086 0 0)
(-0.0182574 0 0)
(-0.0167681 0 0)
(-0.0153384 0 0)
(-0.0139658 0 0)
(-0.012648 0 0)
(-0.0113829 0 0)
(-0.0101683 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
