tests/test_case/pitzDaily/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
0.00015942
0.00015942
0.00015942
0.00015942
0.00015942
0.00015942
0.00015942
0.00015942
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.00015942
0.000489703
0.000843691
0.00122309
0.00162971
0.00206552
0.00253261
0.00303323
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
-0.0162926
-0.0156778
-0.015063
-0.0144481
-0.0138333
-0.0132185
-0.0126037
-0.0119889
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
223
(
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
0.0254
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
250
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
